Revit 2026 API

# DisciplineTypeId Properties

---

The DisciplineTypeId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Architecture | Architecture. |
|  | Common | Common. |
|  | Electrical | Electrical. |
|  | Energy | Energy. |
|  | Hvac | HVAC. |
|  | Infrastructure | Infrastructure. |
|  | Piping | Piping. |
|  | Structural | Structural. |

#### Reference

DisciplineTypeId Class

Autodesk.Revit.DB Namespace